ruslanbd/geekvape-t200MOD/N32G455xx_V3.1.0/N32G455xx_V3.1.0/6-Software Development Kit/pack/Nationstech.N32G45x_DFP.1.0.6.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4.0" 
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
    <vendor>Nationstech</vendor>
    <url>http://www.keil.com/pack/</url>
    <name>N32G45x_DFP</name>

    <description>Nationstech N32G45x Series Device Support, Drivers and Examples</description>

    <releases>
        <release version="1.0.6">
            Add new device N32G452TBQ7.
			Add TIM1 and TIM8 TIMx_CCDAT5 registers.
			del TIM2~TIM5 TIMx_BKDT TIMx_CCMOD3 TIMx_CCDAT6 registers.
			del TIM6 and TIM7 TIMx_SMCTRL TIMx_CCMOD1/2 TIMx_CCEN TIMx_REPCNT TIMx_CCDAT1/2/3/4 TIMx_DCTRL TIMx_DADDR TIMx_BKDT TIMx_CCMOD3 TIMx_CCDAT6 registers.
            Supplement CAN CAN_FiBx registers.
            Add new device N32G451CBL7,N32G451CCL7,N32G451CEL7,N32G451RBL7,N32G451RCL7,N32G451REL7,N32G451VCL7,N32G451VEL7.
        </release>    
        <release version="1.0.5">
            Add WWDG peripheral
            Delete device N32G452CCT7.
        </release>
        <release version="1.0.4">
            Add new device N32G455CEQ7.
        </release>
        <release version="1.0.3">
            Add new device N32G452CCT7.
            Modify some errors of device description.
        </release>
        <release version="1.0.2">
            Add new device N32G452CEL7.
            Delete firmware.
        </release>
        <release version="1.0.1">
            Fix some bugs.
        </release>
        <release version="1.0.0">
            Fix some bugs.
        </release>
        <release version="0.4.0">
            Fix some bugs.
        </release>
        <release version="0.3.0">
            Fix some bugs.
        </release>
        <release version="0.2.0">
            Fix some bugs.
        </release>
        <release version="0.1.0">
            Alpha version of N32G45x Device Family Pack.
        </release>
    </releases>

    <keywords>
        <keyword>Nationstech</keyword>
        <keyword>Device Support</keyword>
        <keyword>N32G45x</keyword>
        <keyword>N32</keyword>
    </keywords>


    <devices>
        <family Dfamily="N32G45x Series" Dvendor="Nationstech:927">
            <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="0" Dendian="Little-endian"/>
            <description>
            </description>

            <subFamily DsubFamily="N32G451">
                <description>
Up to 144MHz ARM Cortex-M4F, 512KB Flash, 96KB SRAM, 7xU(S)ART, 4xI2C, 3xSPI, USB 2.0 FS Device, RTC, 3x 12bit 5Msps ADC, 2x12bit DAC, Hardware Cryptographic Engine.
                </description>
                <processor Dclock="144000000"/>
                <compile header="firmware/CMSIS/device/n32g45x.h" define="N32G45X N32G451 USE_STDPERIPH_DRIVER"/>

<device Dname="N32G451CBL7">
    <description>
&#xA;&#xD;
- Package:LQFP48&#xA;&#xD;
- Clock:  144MHz&#xA;&#xD;
- Flash:  128KB&#xA;&#xD;
- SRAM:   48KB&#xA;&#xD;
- I/O:    37&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  8&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    23&#xA;&#xD;
- ADC:    3x12bit&#xA;&#xD;
- DAC:    2x12-bit&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   3&#xA;&#xD;
- SPI/I2S:3/2&#xA;&#xD;
- I2C:    3&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
&#xA;&#xD;
Remark:&#xA;&#xD;
[1*] Only Single Wire&#xA;&#xD;
[Y*] Only LCD Mode&#xA;&#xD;

    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0xC000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x20000" default="1" startup="1" />
    <algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x20000" default="1" startup="1" />
    <debug svd="svd/N32G451.svd"/>
</device>


<device Dname="N32G451CCL7">
    <description>
&#xA;&#xD;
- Package:LQFP48&#xA;&#xD;
- Clock:  144MHz&#xA;&#xD;
- Flash:  256KB&#xA;&#xD;
- SRAM:   96KB&#xA;&#xD;
- I/O:    37&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  8&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    23&#xA;&#xD;
- ADC:    3x12bit&#xA;&#xD;
- DAC:    2x12-bit&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   3&#xA;&#xD;
- SPI/I2S:3/2&#xA;&#xD;
- I2C:    3&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
&#xA;&#xD;
Remark:&#xA;&#xD;
[1*] Only Single Wire&#xA;&#xD;
[Y*] Only LCD Mode&#xA;&#xD;

    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x18000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x40000" default="1" startup="1" />
    <algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x40000" default="1" startup="1" />
    <debug svd="svd/N32G451.svd"/>
</device>

<device Dname="N32G451CEL7">
    <description>
&#xA;&#xD;
- Package:LQFP48&#xA;&#xD;
- Clock:  144MHz&#xA;&#xD;
- Flash:  512KB&#xA;&#xD;
- SRAM:   96KB&#xA;&#xD;
- I/O:    37&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  8&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    23&#xA;&#xD;
- ADC:    3x12bit&#xA;&#xD;
- DAC:    2x12-bit&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   3&#xA;&#xD;
- SPI/I2S:3/2&#xA;&#xD;
- I2C:    3&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
&#xA;&#xD;
Remark:&#xA;&#xD;
[1*] Only Single Wire&#xA;&#xD;
[Y*] Only LCD Mode&#xA;&#xD;

    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x18000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x80000" default="1" startup="1" />
    <algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x80000" default="1" startup="1" />
    <debug svd="svd/N32G451.svd"/>
</device>

<device Dname="N32G451RBL7">
    <description>
&#xA;&#xD;
- Package:LQFP64&#xA;&#xD;
- Clock:  144MHz&#xA;&#xD;
- Flash:  128KB&#xA;&#xD;
- SRAM:   48KB&#xA;&#xD;
- I/O:    51&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  8&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    24&#xA;&#xD;
- ADC:    3x12bit&#xA;&#xD;
- DAC:    2x12-bit&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   4&#xA;&#xD;
- SPI/I2S:3/2&#xA;&#xD;
- I2C:    4&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
- SDIO:   1&#xA;&#xD;
&#xA;&#xD;
Remark:&#xA;&#xD;
[1*] Only Single Wire&#xA;&#xD;
[Y*] Only LCD Mode&#xA;&#xD;

    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0xC000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x20000" default="1" startup="1" />
    <algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x20000" default="1" startup="1" />
    <debug svd="svd/N32G451.svd"/>
</device>


<device Dname="N32G451RCL7">
    <description>
&#xA;&#xD;
- Package:LQFP64&#xA;&#xD;
- Clock:  144MHz&#xA;&#xD;
- Flash:  256KB&#xA;&#xD;
- SRAM:   96KB&#xA;&#xD;
- I/O:    51&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  8&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    24&#xA;&#xD;
- ADC:    3x12bit&#xA;&#xD;
- DAC:    2x12-bit&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   4&#xA;&#xD;
- SPI/I2S:3/2&#xA;&#xD;
- I2C:    4&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
- SDIO:   1&#xA;&#xD;
&#xA;&#xD;
Remark:&#xA;&#xD;
[1*] Only Single Wire&#xA;&#xD;
[Y*] Only LCD Mode&#xA;&#xD;

    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x18000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x40000" default="1" startup="1" />
    <algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x40000" default="1" startup="1" />
    <debug svd="svd/N32G451.svd"/>
</device>

<device Dname="N32G451REL7">
    <description>
&#xA;&#xD;
- Package:LQFP64&#xA;&#xD;
- Clock:  144MHz&#xA;&#xD;
- Flash:  512KB&#xA;&#xD;
- SRAM:   96KB&#xA;&#xD;
- I/O:    51&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  8&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    24&#xA;&#xD;
- ADC:    3x12bit&#xA;&#xD;
- DAC:    2x12-bit&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   4&#xA;&#xD;
- SPI/I2S:3/2&#xA;&#xD;
- I2C:    4&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
- SDIO:   1&#xA;&#xD;
&#xA;&#xD;
Remark:&#xA;&#xD;
[1*] Only Single Wire&#xA;&#xD;
[Y*] Only LCD Mode&#xA;&#xD;

    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x18000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x80000" default="1" startup="1" />
    <algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x80000" default="1" startup="1" />
    <debug svd="svd/N32G451.svd"/>
</device>


<device Dname="N32G451VCL7">
    <description>
&#xA;&#xD;
- Package:LQFP100&#xA;&#xD;
- Clock:  144MHz&#xA;&#xD;
- Flash:  256KB&#xA;&#xD;
- SRAM:   96KB&#xA;&#xD;
- I/O:    80&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  8&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    24&#xA;&#xD;
- ADC:    3x12bit&#xA;&#xD;
- DAC:    2x12-bit&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   4&#xA;&#xD;
- SPI/I2S:3/2&#xA;&#xD;
- I2C:    4&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
- SDIO:   1&#xA;&#xD;
&#xA;&#xD;
Remark:&#xA;&#xD;
[1*] Only Single Wire&#xA;&#xD;
[Y*] Only LCD Mode&#xA;&#xD;

    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x18000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x40000" default="1" startup="1" />
    <algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x40000" default="1" startup="1" />
    <debug svd="svd/N32G451.svd"/>
</device>


<device Dname="N32G451VEL7">
    <description>
&#xA;&#xD;
- Package:LQFP100&#xA;&#xD;
- Clock:  144MHz&#xA;&#xD;
- Flash:  512KB&#xA;&#xD;
- SRAM:   96KB&#xA;&#xD;
- I/O:    80&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  8&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    24&#xA;&#xD;
- ADC:    3x12bit&#xA;&#xD;
- DAC:    2x12-bit&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   4&#xA;&#xD;
- SPI/I2S:3/2&#xA;&#xD;
- I2C:    4&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    1&#xA;&#xD;
- SDIO:   1&#xA;&#xD;
&#xA;&#xD;
Remark:&#xA;&#xD;
[1*] Only Single Wire&#xA;&#xD;
[Y*] Only LCD Mode&#xA;&#xD;

    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x18000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x80000" default="1" startup="1" />
    <algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x80000" default="1" startup="1" />
    <debug svd="svd/N32G451.svd"/>
</device>

            </subFamily>
            <subFamily DsubFamily="N32G452">
                <description>
Up to 144MHz ARM Cortex-M4F, 512KB Flash, 144KB SRAM, 7xU(S)ART, 4xI2C, 3xSPI, 1xQSPI, USB 2.0 FS Device, RTC, 2x 12bit 5Msps ADC, 2x12bit DAC, Hardware Cryptographic Engine.
                </description>
                <processor Dclock="144000000"/>
                <compile header="firmware/CMSIS/device/n32g45x.h" define="N32G45X N32G452 USE_STDPERIPH_DRIVER"/>

