ruslanbd/geekvape-t200MOD/N32G455xx_V3.1.0/N32G455xx_V3.1.0/6-Software Development Kit/pack/Nationstech.N32G45x_DFP.1.0.6.pdsc
<device Dname="N32G452CBL7">
    <description>
&#xA;&#xD;
- Package:LQFP48&#xA;&#xD;
- Clock:  144MHz&#xA;&#xD;
- Flash:  128KB&#xA;&#xD;
- SRAM:   80KB&#xA;&#xD;
- I/O:    37&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  8&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    23&#xA;&#xD;
- ADC:    2x12bit with 10 channels&#xA;&#xD;
- DAC:    2x12-bit&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   3&#xA;&#xD;
- SPI/I2S:3/2&#xA;&#xD;
- I2C:    3&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    2&#xA;&#xD;
- QSPI:   1*&#xA;&#xD;
&#xA;&#xD;
Remark:&#xA;&#xD;
[1*] Only Single Wire&#xA;&#xD;
[Y*] Only LCD Mode&#xA;&#xD;

    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x14000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x20000" default="1" startup="1" />
    <algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x20000" default="1" startup="1" />
    <debug svd="svd/N32G452.svd"/>
</device>


<device Dname="N32G452CCL7">
    <description>
&#xA;&#xD;
- Package:LQFP48&#xA;&#xD;
- Clock:  144MHz&#xA;&#xD;
- Flash:  256KB&#xA;&#xD;
- SRAM:   144KB&#xA;&#xD;
- I/O:    37&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  8&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    23&#xA;&#xD;
- ADC:    2x12bit with 10 channels&#xA;&#xD;
- DAC:    2x12-bit&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   3&#xA;&#xD;
- SPI/I2S:3/2&#xA;&#xD;
- I2C:    3&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    2&#xA;&#xD;
- QSPI:   1*&#xA;&#xD;
&#xA;&#xD;
Remark:&#xA;&#xD;
[1*] Only Single Wire&#xA;&#xD;
[Y*] Only LCD Mode&#xA;&#xD;

    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x24000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x40000" default="1" startup="1" />
    <algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x40000" default="1" startup="1" />
    <debug svd="svd/N32G452.svd"/>
</device>

<device Dname="N32G452CEL7">
    <description>
&#xA;&#xD;
- Package:LQFP48&#xA;&#xD;
- Clock:  144MHz&#xA;&#xD;
- Flash:  512KB&#xA;&#xD;
- SRAM:   144KB&#xA;&#xD;
- I/O:    37&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  8&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    23&#xA;&#xD;
- ADC:    2x12bit with 10 channels&#xA;&#xD;
- DAC:    2x12-bit&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   3&#xA;&#xD;
- SPI/I2S:3/2&#xA;&#xD;
- I2C:    3&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    2&#xA;&#xD;
- QSPI:   1*&#xA;&#xD;
&#xA;&#xD;
Remark:&#xA;&#xD;
[1*] Only Single Wire&#xA;&#xD;
[Y*] Only LCD Mode&#xA;&#xD;

    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x24000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x80000" default="1" startup="1" />
    <algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x80000" default="1" startup="1" />
    <debug svd="svd/N32G452.svd"/>
</device>

<device Dname="N32G452RBL7">
    <description>
&#xA;&#xD;
- Package:LQFP64&#xA;&#xD;
- Clock:  144MHz&#xA;&#xD;
- Flash:  128KB&#xA;&#xD;
- SRAM:   80KB&#xA;&#xD;
- I/O:    51&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  8&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    24&#xA;&#xD;
- ADC:    2x12bit with 16 channels&#xA;&#xD;
- DAC:    2x12-bit&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   4&#xA;&#xD;
- SPI/I2S:3/2&#xA;&#xD;
- I2C:    4&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    2&#xA;&#xD;
- QSPI:   1&#xA;&#xD;
- SDIO:   1&#xA;&#xD;
&#xA;&#xD;
Remark:&#xA;&#xD;
[1*] Only Single Wire&#xA;&#xD;
[Y*] Only LCD Mode&#xA;&#xD;

    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x14000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x20000" default="1" startup="1" />
    <algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x20000" default="1" startup="1" />
    <debug svd="svd/N32G452.svd"/>
</device>


<device Dname="N32G452RCL7">
    <description>
&#xA;&#xD;
- Package:LQFP64&#xA;&#xD;
- Clock:  144MHz&#xA;&#xD;
- Flash:  256KB&#xA;&#xD;
- SRAM:   144KB&#xA;&#xD;
- I/O:    51&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  8&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    24&#xA;&#xD;
- ADC:    2x12bit with 16 channels&#xA;&#xD;
- DAC:    2x12-bit&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   4&#xA;&#xD;
- SPI/I2S:3/2&#xA;&#xD;
- I2C:    4&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    2&#xA;&#xD;
- QSPI:   1&#xA;&#xD;
- SDIO:   1&#xA;&#xD;
&#xA;&#xD;
Remark:&#xA;&#xD;
[1*] Only Single Wire&#xA;&#xD;
[Y*] Only LCD Mode&#xA;&#xD;

    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x24000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x40000" default="1" startup="1" />
    <algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x40000" default="1" startup="1" />
    <debug svd="svd/N32G452.svd"/>
</device>

<device Dname="N32G452REL7">
    <description>
&#xA;&#xD;
- Package:LQFP64&#xA;&#xD;
- Clock:  144MHz&#xA;&#xD;
- Flash:  512KB&#xA;&#xD;
- SRAM:   144KB&#xA;&#xD;
- I/O:    51&#xA;&#xD;
- Voltage: 1.8V~3.6V -40~+105°C&#xA;&#xD;
- Timer:  8&#xA;&#xD;
- RTC:    1&#xA;&#xD;
- PWM:    24&#xA;&#xD;
- ADC:    2x12bit with 16 channels&#xA;&#xD;
- DAC:    2x12-bit&#xA;&#xD;
- USART:  3&#xA;&#xD;
- UART:   4&#xA;&#xD;
- SPI/I2S:3/2&#xA;&#xD;
- I2C:    4&#xA;&#xD;
- USB Device: 1&#xA;&#xD;
- CAN:    2&#xA;&#xD;
- QSPI:   1&#xA;&#xD;
- SDIO:   1&#xA;&#xD;
&#xA;&#xD;
Remark:&#xA;&#xD;
[1*] Only Single Wire&#xA;&#xD;
[Y*] Only LCD Mode&#xA;&#xD;

    </description>
    <memory id="IRAM1" access="rw" start="0x20000000" size="0x24000" default="1" init="0" />
    <memory id="IROM1" access="rx" start="0x08000000" size="0x80000" default="1" startup="1" />
    <algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x80000" default="1" startup="1" />
    <debug svd="svd/N32G452.svd"/>
</device>


